; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph1 - mode
	infrared0 - mode
	image5 - mode
	infrared7 - mode
	infrared9 - mode
	infrared3 - mode
	thermograph6 - mode
	thermograph10 - mode
	spectrograph4 - mode
	infrared2 - mode
	infrared8 - mode
	Star3 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 image5)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph10)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 spectrograph4)
	(supports instrument3 image5)
	(supports instrument3 infrared3)
	(supports instrument3 infrared7)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 infrared0)
	(supports instrument4 infrared8)
	(supports instrument4 thermograph6)
	(supports instrument4 infrared9)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(have_image Star5 thermograph10)
	(have_image Star5 infrared0)
	(have_image Planet6 infrared7)
	(have_image Planet6 infrared3)
	(have_image Planet6 spectrograph1)
	(have_image Planet7 infrared9)
	(have_image Planet7 infrared0)
	(have_image Planet7 infrared2)
	(have_image Star8 image5)
	(have_image Star9 infrared9)
))

)

; plan
1. (turn_to satellite2 groundstation2 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 11
2. (turn_to satellite1 star4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star4)
   goals met: 1 of 11
3. (turn_to satellite0 star0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star0)
   goals met: 0 of 11
4. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 11
5. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
7. (calibrate satellite2 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 11
8. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 11
9. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 11
10. (turn_to satellite0 planet7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet7)
   goals met: 0 of 11
11. (take_image satellite0 planet7 instrument1 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 1 of 11
12. (take_image satellite0 planet7 instrument1 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 2 of 11
13. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   goals met: 2 of 11
14. (take_image satellite0 star5 instrument1 infrared0)
   added: (have_image star5 infrared0)
   goals met: 3 of 11
15. (take_image satellite0 star5 instrument1 thermograph10)
   added: (have_image star5 thermograph10)
   goals met: 4 of 11
16. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 11
17. (turn_to satellite1 planet6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet6)
   goals met: 5 of 11
18. (take_image satellite1 planet6 instrument3 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 6 of 11
19. (take_image satellite1 planet6 instrument3 infrared7)
   added: (have_image planet6 infrared7)
   goals met: 7 of 11
20. (turn_to satellite1 star8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star8)
   goals met: 7 of 11
21. (take_image satellite1 star8 instrument3 image5)
   added: (have_image star8 image5)
   goals met: 8 of 11
22. (turn_to satellite2 planet6 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet6)
   goals met: 8 of 11
23. (take_image satellite2 planet6 instrument4 spectrograph1)
   added: (have_image planet6 spectrograph1)
   goals met: 9 of 11
24. (turn_to satellite2 planet7 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet7)
   goals met: 9 of 11
25. (take_image satellite2 planet7 instrument4 infrared9)
   added: (have_image planet7 infrared9)
   goals met: 10 of 11
26. (turn_to satellite2 star9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star9)
   goals met: 10 of 11
27. (take_image satellite2 star9 instrument4 infrared9)
   added: (have_image star9 infrared9)
   goals met: 11 of 11
